Duet3D/Duet3Expansion/src/atmel/SAMDA1_DFP/1.2.50/samda1/atdf/ATSAMDA1G16A.atdf
        <register name="CLKCTRL" offset="0x4" rw="RW" size="4" count="2" initval="0x00000000" caption="Clock Unit n Control">
          <bitfield name="SLOTSIZE" caption="Slot Size" mask="0x3" values="I2S_CLKCTRL__SLOTSIZE"/>
          <bitfield name="NBSLOTS" caption="Number of Slots in Frame" mask="0x1C"/>
          <bitfield name="FSWIDTH" caption="Frame Sync Width" mask="0x60" values="I2S_CLKCTRL__FSWIDTH"/>
          <bitfield name="BITDELAY" caption="Data Delay from Frame Sync" mask="0x80" values="I2S_CLKCTRL__BITDELAY"/>
          <bitfield name="FSSEL" caption="Frame Sync Select" mask="0x100" values="I2S_CLKCTRL__FSSEL"/>
          <bitfield name="FSINV" caption="Frame Sync Invert" mask="0x800"/>
          <bitfield name="SCKSEL" caption="Serial Clock Select" mask="0x1000" values="I2S_CLKCTRL__SCKSEL"/>
          <bitfield name="MCKSEL" caption="Master Clock Select" mask="0x10000" values="I2S_CLKCTRL__MCKSEL"/>
          <bitfield name="MCKEN" caption="Master Clock Enable" mask="0x40000"/>
          <bitfield name="MCKDIV" caption="Master Clock Division Factor" mask="0xF80000"/>
          <bitfield name="MCKOUTDIV" caption="Master Clock Output Division Factor" mask="0x1F000000"/>
          <bitfield name="FSOUTINV" caption="Frame Sync Output Invert" mask="0x20000000"/>
          <bitfield name="SCKOUTINV" caption="Serial Clock Output Invert" mask="0x40000000"/>
          <bitfield name="MCKOUTINV" caption="Master Clock Output Invert" mask="0x80000000"/>
        </register>
        <register name="INTENCLR" offset="0xC" rw="RW" size="2" atomic-op="clear:INTENCLR" initval="0x0000" caption="Interrupt Enable Clear">
          <bitfield name="RXRDY0" caption="Receive Ready 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="RXRDY1" caption="Receive Ready 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="RXOR0" caption="Receive Overrun 0 Interrupt Enable" mask="0x10"/>
          <bitfield name="RXOR1" caption="Receive Overrun 1 Interrupt Enable" mask="0x20"/>
          <bitfield name="TXRDY0" caption="Transmit Ready 0 Interrupt Enable" mask="0x100"/>
          <bitfield name="TXRDY1" caption="Transmit Ready 1 Interrupt Enable" mask="0x200"/>
          <bitfield name="TXUR0" caption="Transmit Underrun 0 Interrupt Enable" mask="0x1000"/>
          <bitfield name="TXUR1" caption="Transmit Underrun 1 Interrupt Enable" mask="0x2000"/>
        </register>
        <register name="INTENSET" offset="0x10" rw="RW" size="2" atomic-op="set:INTENSET" initval="0x0000" caption="Interrupt Enable Set">
          <bitfield name="RXRDY0" caption="Receive Ready 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="RXRDY1" caption="Receive Ready 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="RXOR0" caption="Receive Overrun 0 Interrupt Enable" mask="0x10"/>
          <bitfield name="RXOR1" caption="Receive Overrun 1 Interrupt Enable" mask="0x20"/>
          <bitfield name="TXRDY0" caption="Transmit Ready 0 Interrupt Enable" mask="0x100"/>
          <bitfield name="TXRDY1" caption="Transmit Ready 1 Interrupt Enable" mask="0x200"/>
          <bitfield name="TXUR0" caption="Transmit Underrun 0 Interrupt Enable" mask="0x1000"/>
          <bitfield name="TXUR1" caption="Transmit Underrun 1 Interrupt Enable" mask="0x2000"/>
        </register>
        <register name="INTFLAG" offset="0x14" rw="RW" size="2" atomic-op="clear:INTFLAG" initval="0x0000" caption="Interrupt Flag Status and Clear">
          <bitfield name="RXRDY0" caption="Receive Ready 0" mask="0x1"/>
          <bitfield name="RXRDY1" caption="Receive Ready 1" mask="0x2"/>
          <bitfield name="RXOR0" caption="Receive Overrun 0" mask="0x10"/>
          <bitfield name="RXOR1" caption="Receive Overrun 1" mask="0x20"/>
          <bitfield name="TXRDY0" caption="Transmit Ready 0" mask="0x100"/>
          <bitfield name="TXRDY1" caption="Transmit Ready 1" mask="0x200"/>
          <bitfield name="TXUR0" caption="Transmit Underrun 0" mask="0x1000"/>
          <bitfield name="TXUR1" caption="Transmit Underrun 1" mask="0x2000"/>
        </register>
        <register name="SYNCBUSY" offset="0x18" rw="R" size="2" initval="0x0000" caption="Synchronization Status">
          <bitfield name="SWRST" caption="Software Reset Synchronization Status" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable Synchronization Status" mask="0x2"/>
          <bitfield name="CKEN0" caption="Clock Unit 0 Enable Synchronization Status" mask="0x4"/>
          <bitfield name="CKEN1" caption="Clock Unit 1 Enable Synchronization Status" mask="0x8"/>
          <bitfield name="SEREN0" caption="Serializer 0 Enable Synchronization Status" mask="0x10"/>
          <bitfield name="SEREN1" caption="Serializer 1 Enable Synchronization Status" mask="0x20"/>
          <bitfield name="DATA0" caption="Data 0 Synchronization Status" mask="0x100"/>
          <bitfield name="DATA1" caption="Data 1 Synchronization Status" mask="0x200"/>
        </register>
        <register name="SERCTRL" offset="0x20" rw="RW" size="4" count="2" initval="0x00000000" caption="Serializer n Control">
          <bitfield name="SERMODE" caption="Serializer Mode" mask="0x3" values="I2S_SERCTRL__SERMODE"/>
          <bitfield name="TXDEFAULT" caption="Line Default Line when Slot Disabled" mask="0xC" values="I2S_SERCTRL__TXDEFAULT"/>
          <bitfield name="TXSAME" caption="Transmit Data when Underrun" mask="0x10" values="I2S_SERCTRL__TXSAME"/>
          <bitfield name="CLKSEL" caption="Clock Unit Selection" mask="0x20" values="I2S_SERCTRL__CLKSEL"/>
          <bitfield name="SLOTADJ" caption="Data Slot Formatting Adjust" mask="0x80" values="I2S_SERCTRL__SLOTADJ"/>
          <bitfield name="DATASIZE" caption="Data Word Size" mask="0x700" values="I2S_SERCTRL__DATASIZE"/>
          <bitfield name="WORDADJ" caption="Data Word Formatting Adjust" mask="0x1000" values="I2S_SERCTRL__WORDADJ"/>
          <bitfield name="EXTEND" caption="Data Formatting Bit Extension" mask="0x6000" values="I2S_SERCTRL__EXTEND"/>
          <bitfield name="BITREV" caption="Data Formatting Bit Reverse" mask="0x8000" values="I2S_SERCTRL__BITREV"/>
          <bitfield name="SLOTDIS0" caption="Slot 0 Disabled for this Serializer" mask="0x10000"/>
          <bitfield name="SLOTDIS1" caption="Slot 1 Disabled for this Serializer" mask="0x20000"/>
          <bitfield name="SLOTDIS2" caption="Slot 2 Disabled for this Serializer" mask="0x40000"/>
          <bitfield name="SLOTDIS3" caption="Slot 3 Disabled for this Serializer" mask="0x80000"/>
          <bitfield name="SLOTDIS4" caption="Slot 4 Disabled for this Serializer" mask="0x100000"/>
          <bitfield name="SLOTDIS5" caption="Slot 5 Disabled for this Serializer" mask="0x200000"/>
          <bitfield name="SLOTDIS6" caption="Slot 6 Disabled for this Serializer" mask="0x400000"/>
          <bitfield name="SLOTDIS7" caption="Slot 7 Disabled for this Serializer" mask="0x800000"/>
          <bitfield name="MONO" caption="Mono Mode" mask="0x1000000" values="I2S_SERCTRL__MONO"/>
          <bitfield name="DMA" caption="Single or Multiple DMA Channels" mask="0x2000000" values="I2S_SERCTRL__DMA"/>
          <bitfield name="RXLOOP" caption="Loop-back Test Mode" mask="0x4000000"/>
        </register>
        <register name="DATA" offset="0x30" rw="RW" access="RWSYNC" size="4" count="2" initval="0x00000000" caption="Data n">
          <bitfield name="DATA" caption="Sample Data" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <value-group name="I2S_CLKCTRL__BITDELAY">
        <value name="LJ" caption="Left Justified (0 Bit Delay)" value="0x0"/>
        <value name="I2S" caption="I2S (1 Bit Delay)" value="0x1"/>
      </value-group>
      <value-group name="I2S_CLKCTRL__FSSEL">
        <value name="SCKDIV" caption="Divided Serial Clock n is used as Frame Sync n source" value="0x0"/>
        <value name="FSPIN" caption="FSn input pin is used as Frame Sync n source" value="0x1"/>
      </value-group>
      <value-group name="I2S_CLKCTRL__FSWIDTH">
        <value name="SLOT" caption="Frame Sync Pulse is 1 Slot wide (default for I2S protocol)" value="0x0"/>
        <value name="HALF" caption="Frame Sync Pulse is half a Frame wide" value="0x1"/>
        <value name="BIT" caption="Frame Sync Pulse is 1 Bit wide" value="0x2"/>
        <value name="BURST" caption="Clock Unit n operates in Burst mode, with a 1-bit wide Frame Sync pulse per Data sample, only when Data transfer is requested" value="0x3"/>
      </value-group>
